<?php 

// 第六章 函数
if($_GET['a']) $_GET['a']();


// ----------------------------------------------------------------------------
// 1.访问函数的参数
function add_one($number){
	$number++;
}


// ----------------------------------------------------------------------------
// 2.为函数的参数设定默认值
function wrap_html_tag($string, $tag='b'){
	return "<$tag>$string</$tag>";
}


// ----------------------------------------------------------------------------
// 3.传递引用
function wrap_html_tag(&$string, $tag='b'){
	// 把变量传递给函数 并保留对变量的修改
	$string = "<$tag>$string</$tag>";
}
